{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 1], "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.3, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.3, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 128, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 2, "name": "dense_2", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}