{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "bias_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 32, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 128, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "units": 2, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null}}]}